In [7]:
import pandas as pd

df = pd.read_csv("../day2/sample_data.csv")
df

   order_id customer  amount     category       city
0       101    Alice    1200  Electronics      Delhi
1       102      Bob     800     Clothing     Mumbai
2       103  Charlie    1500  Electronics  Bangalore
3       104    Alice     700     Clothing      Delhi
4       105      Bob    2000  Electronics     Mumbai

In [10]:
# How much did each customer spend on each category?
df.groupby(["customer", "category"])["amount"].sum()

customer  category
Alice     Clothing        700
          Electronics    1200
Bob       Clothing        800
          Electronics    2000
Charlie   Electronics    1500
Name: amount, dtype: int64

In [12]:
#What is the average order value per city? 
df.groupby(["city"])["amount"].mean()

city
Bangalore    1500.0
Delhi         950.0
Mumbai       1400.0
Name: amount, dtype: float64

In [15]:
#Which category generates more revenue overall?
df.groupby(["category"])["amount"].sum().idxmax()

'Electronics'